# Leetcodes SQL 50 with Answers

## Select

### 1757: Recyclable and Low Fat Products

Write a solution to find the ids of products that are both low fat and recyclable.

Return the result table in any order.

- Table: products
| column_name | type | 
|----------|----------|
| product_id | int | 
| low_fats | enum | 
| recyclable|enum|

- product_id is the primary key (column with unique values) for this table.
- low_fats is an ENUM (category) of type ('Y', 'N') where 'Y' means this product is low fat and 'N' means it is not.
- recyclable is an ENUM (category) of types ('Y', 'N') where 'Y' means this product is recyclable and 'N' means it is not.

### 584: Find Customer Referee
Find the names of the customer that are either

- referred by any customer with id != 2.
- not referred by any customer.

Return the result table in any order.

- Table: Customer
| column_name | type | 
|----------|----------|
| id | int | 
| name | varchar | 
| referee_id|int|


- In SQL, id is the primary key column for this table.
- Each row of this table indicates the id of a customer, their name, and the id of the customer who referred them.

### 595: Big Countries

Write a solution to find the name, population, and area of the big countries.
- A country is big if:

    - it has an area of at least three million (i.e., 3000000 km2), or
    - it has a population of at least twenty-five million (i.e., 25000000).

Table: World

| Column Name | Type    |
|----------|----------|
| name        | varchar |
| continent   | varchar |
| area        | int     |
| population  | int     |
| gdp         | bigint  |

- name is the primary key (column with unique values) for this table.
- Each row of this table gives information about the name of a country, the continent to which it belongs, its area, the population, and its GDP value.

### 1148: Article Views I
Write a solution to find all the authors that viewed at least one of their own articles.

Return the result table sorted by id in ascending order.

Table: Views

| Column Name | Type    |
|----------|----------|
| article_id    | int     |
| author_id     | int     |
| viewer_id     | int     |
| view_date     | date    |

- There is no primary key (column with unique values) for this table, the table may have duplicate rows.
- Each row of this table indicates that some viewer viewed an article (written by some author) on some date. 
- Note that equal author_id and viewer_id indicate the same person.

### 1683: Invalid Tweets

Write a solution to find the IDs of the invalid tweets. The tweet is invalid if the number of characters used in the content of the tweet is strictly greater than 15.

Table: Tweets

| Column Name | Type    |
|----------|----------|
| tweet_id       | int     |
| content        | varchar |


- tweet_id is the primary key (column with unique values) for this table.
- content consists of alphanumeric characters, '!', or ' ' and no other special characters.
- This table contains all the tweets in a social media app.

## Basic Joins

### 1378: Replace Employee ID With The Unique Identifier

Write a solution to show the unique ID of each user, If a user does not have a unique ID replace just show null.

Return the result table in any order.

Table: Employees

| Column Name | Type    |
|----------|----------|
| id            | int     |
| name          | varchar |

- id is the primary key (column with unique values) for this table.
- Each row of this table contains the id and the name of an employee in a company.
 

Table: EmployeeUNI

| Column Name | Type    |
|----------|----------|
| id            | int     |
| unique_id     | int     |

- (id, unique_id) is the primary key (combination of columns with unique values) for this table.
- Each row of this table contains the id and the corresponding unique id of an employee in the company.

In [ ]:
select e1.name, e2.unique_id from Employees e1 left join EmployeeUNI e2 on e1.id = e2.id

### 1068: Product Sales Analysis I

Write a solution to report the product_name, year, and price for each sale_id in the Sales table.

Return the resulting table in any order.

Table: Sales

| Column Name | Type    |
|----------|----------|
| sale_id     | int   |
| product_id  | int   |
| year        | int   |
| quantity    | int   |
| price       | int   |


- (sale_id, year) is the primary key (combination of columns with unique values) of this table.
- product_id is a foreign key (reference column) to Product table.
- Each row of this table shows a sale on the product product_id in a certain year.
- Note that the price is per unit.
 

Table: Product

| Column Name | Type    |
|----------|----------|
| product_id   | int     |
| product_name | varchar |

- product_id is the primary key (column with unique values) of this table.
- Each row of this table indicates the product name of each product.

In [ ]:
select s.sale_id, p.product_name, s.year, s.price from Sales as s left join Product as p on s.product_id = p.product_id

### 1581: Customer Who Visited but Did Not Make Any Transactions

Write a solution to find the IDs of the users who visited without making any transactions and the number of times they made these types of visits.

Return the result table sorted in any order.


Table: Visits

| Column Name | Type    |
|----------|----------|
| visit_id    | int     |
| customer_id | int     |

- visit_id is the column with unique values for this table.
- This table contains information about the customers who visited the mall.
 

Table: Transactions

| Column Name | Type    |
|----------|----------|
| transaction_id | int     |
| visit_id       | int     |
| amount         | int     |

- transaction_id is column with unique values for this table.
- This table contains information about the transactions made during the visit_id.

In [ ]:
select v.customer_id, COUNT(v.visit_id) as count_no_trans from Visits v left join Transactions t on v.visit_id = t.visit_id where t.transaction_id IS null group by v.customer_id

### 197: Rising Temperature
Write a solution to find all dates' id with higher temperatures compared to its previous dates (yesterday).

Return the result table in any order.

Table: Weather

| Column Name | Type    |
|----------|----------|
| id            | int     |
| recordDate    | date    |
| temperature   | int     |

- id is the column with unique values for this table.
- There are no different rows with the same recordDate.
- This table contains information about the temperature on a certain day.

In [ ]:
select w1.id from weather w1 left join weather w2 where w1.recordDate = DATEADD(day, 1, CAST(w2.recordDate AS date)) and w1.temperature > w2.temperature

### 1661: Average Time of Process per Machine

There is a factory website that has several machines each running the same number of processes. Write a solution to find the average time each machine takes to complete a process.

- The time to complete a process is the 'end' timestamp minus the 'start' timestamp. 
- The average time is calculated by the total time to complete every process on the machine divided by the number of processes that were run.

The resulting table should have the machine_id along with the average time as processing_time, which should be rounded to 3 decimal places.

Return the result table in any order.

Table: Activity

| Column Name | Type    |
|----------|----------|
| machine_id     | int     |
| process_id     | int     |
| activity_type  | enum    |
| timestamp      | float   |

- The table shows the user activities for a factory website.
- (machine_id, process_id, activity_type) is the primary key (combination of columns with unique values) of this table.
- machine_id is the ID of a machine.
- process_id is the ID of a process running on the machine with ID machine_id.
- activity_type is an ENUM (category) of type ('start', 'end').
- timestamp is a float representing the current time in seconds.
- 'start' means the machine starts the process at the given timestamp and 'end' means the machine ends the process at the given timestamp.
    - The 'start' timestamp will always be before the 'end' timestamp for every (machine_id, process_id) pair.
    - It is guaranteed that each (machine_id, process_id) pair has a 'start' and 'end' timestamp.

In [ ]:
select a1.machine_id, round(avg(a1.timestamp - a2.timestamp),3) from Activity a1 left join Activity a2 
on a1.machine_id = a2.machine_id and a1.process_id = a2.process_id 
where a1.activity_type = 'end' and a2.activity_type = 'start' group by a1.machine_id

### 577: Employee Bonus

Write a solution to report the name and bonus amount of each employee who satisfies either of the following:

The employee has a bonus less than 1000.
The employee did not get any bonus.

Return the result table in any order.

Table: Employee

| Column Name | Type    |
|----------|----------|
| empId       | int     |
| name        | varchar |
| supervisor  | int     |
| salary      | int     |

- empId is the column with unique values for this table.
- Each row of this table indicates the name and the ID of an employee in addition to their salary and the id of their manager.
 

Table: Bonus

| Column Name | Type    |
|----------|----------|
| empId       | int  |
| bonus       | int  |

- empId is the column of unique values for this table.
- empId is a foreign key (reference column) to empId from the Employee table.
- Each row of this table contains the id of an employee and their respective bonus.

In [ ]:
select e.name, b.bonus from Employee e left join Bonus b on e.empId = b.empId where b.bonus < 1000 or b.bonus is null

### 1280: Students and Examinations
Write a solution to find the number of times each student attended each exam.

Return the result table ordered by student_id and subject_name.

Table: Students

| Column Name | Type    |
|----------|----------|
| student_id    | int     |
| student_name  | varchar |

- student_id is the primary key (column with unique values) for this table.
- Each row of this table contains the ID and the name of one student in the school.
 

Table: Subjects

| Column Name | Type    |
|----------|----------|
| subject_name | varchar |

- subject_name is the primary key (column with unique values) for this table.
- Each row of this table contains the name of one subject in the school.
 

Table: Examinations

| Column Name | Type    |
|----------|----------|
| student_id   | int     |
| subject_name | varchar |

- There is no primary key (column with unique values) for this table. It may contain duplicates.
- Each student from the Students table takes every course from the Subjects table.
- Each row of this table indicates that a student with ID student_id attended the exam of subject_name.
 
Example:

Example 1:

Input: 
Students table:

| student_id| student_name|
|----------|----------|
| 1          | Alice        |
| 2          | Bob          |
| 13         | John         |
| 6          | Alex         |

Subjects table:

| subject_name| 
|----------|
| Math         |
| Physics      |
| Programming  |

Examinations table:

| student_id| subject_name|
|----------|----------|
| 1          | Math         |
| 1          | Physics      |
| 1          | Programming  |
| 2          | Programming  |
| 1          | Physics      |
| 1          | Math         |
| 13         | Math         |
| 13         | Programming  |
| 13         | Physics      |
| 2          | Math         |
| 1          | Math         |

Output: 

| student_id | student_name | subject_name | attended_exams |
|----------|----------|----------|----------|
| 1          | Alice        | Math         | 3              |
| 1          | Alice        | Physics      | 2              |
| 1          | Alice        | Programming  | 1              |
| 2          | Bob          | Math         | 1              |
| 2          | Bob          | Physics      | 0              |
| 2          | Bob          | Programming  | 1              |
| 6          | Alex         | Math         | 0              |
| 6          | Alex         | Physics      | 0              |
| 6          | Alex         | Programming  | 0              |
| 13         | John         | Math         | 1              |
| 13         | John         | Physics      | 1              |
| 13         | John         | Programming  | 1              |

Explanation: 
- The result table should contain all students and all subjects.
- Alice attended the Math exam 3 times, the Physics exam 2 times, and the Programming exam 1 time.
- Bob attended the Math exam 1 time, the Programming exam 1 time, and did not attend the Physics exam.
- Alex did not attend any exams.
- John attended the Math exam 1 time, the Physics exam 1 time, and the Programming exam 1 time.

In [ ]:
select student_id, student_name, subject_name, count(student_id) from  Examinations e 
on s.student_id = e.student_id

### 570: Managers with at Least 5 Direct Reports (Medium)
Write a solution to find managers with at least five direct reports.

Return the result table in any order.

Table: Employee

| Column Name | Type    |
|----------|----------|
| id          | int     |
| name        | varchar |
| department  | varchar |
| managerId   | int     |

- id is the primary key (column with unique values) for this table.
- Each row of this table indicates the name of an employee, their department, and the id of their manager.
- If managerId is null, then the employee does not have a manager.
- No employee will be the manager of themself.

### 1934: Confirmation Rate (Medium)
Write a solution to find the confirmation rate of each user.

The confirmation rate of a user is the number of 'confirmed' messages divided by the total number of requested confirmation messages. The confirmation rate of a user that did not request any confirmation messages is 0. Round the confirmation rate to two decimal places.


Return the result table in any order.

Table: Signups

| Column Name | Type    |
|----------|----------|
| user_id        | int      |
| time_stamp     | datetime |

- user_id is the column of unique values for this table.
- Each row contains information about the signup time for the user with ID user_id.
 

Table: Confirmations

| Column Name | Type    |
|----------|----------|
| user_id        | int      |
| time_stamp     | datetime |
| action         | ENUM     |

- (user_id, time_stamp) is the primary key (combination of columns with unique values) for this table.
- user_id is a foreign key (reference column) to the Signups table.
- action is an ENUM (category) of the type ('confirmed', 'timeout')
- Each row of this table indicates that the user with ID user_id requested a confirmation message at time_stamp and that confirmation message was - either confirmed ('confirmed') or expired without confirming ('timeout').

## Basic Aggregate Functions

### 620: Not Boring Movies
Write a solution to report the movies with an odd-numbered ID and a description that is not "boring".

Return the result table ordered by rating in descending order.

Table: Cinema

| Column Name | Type    |
|----------|----------|
| id             | int      |
| movie          | varchar  |
| description    | varchar  |
| rating         | float    |

- id is the primary key (column with unique values) for this table.
- Each row contains information about the name of a movie, its genre, and its rating.
- rating is a 2 decimal places float in the range [0, 10]

### 1251: Average Selling Price

Write a solution to find the average selling price for each product. average_price should be rounded to 2 decimal places. If a product does not have any sold units, its average selling price is assumed to be 0.

Return the result table in any order.

Table: Prices

| Column Name | Type    |
|----------|----------|
| product_id    | int     |
| start_date    | date    |
| end_date      | date    |
| price         | int     |

- (product_id, start_date, end_date) is the primary key (combination of columns with unique values) for this table.
- Each row of this table indicates the price of the product_id in the period from start_date to end_date.
- For each product_id there will be no two overlapping periods. That means there will be no two intersecting periods for the same product_id.
 

Table: UnitsSold

| Column Name | Type    |
|----------|----------|
| product_id    | int     |
| purchase_date | date    |
| units         | int     |

- This table may contain duplicate rows.
- Each row of this table indicates the date, units, and product_id of each product sold. 

 Example:

 Input: 
Prices table:

| product_id | start_date | end_date   | price  |
|------------|------------|------------|--------|
| 1          | 2019-02-17 | 2019-02-28 | 5      |
| 1          | 2019-03-01 | 2019-03-22 | 20     |
| 2          | 2019-02-01 | 2019-02-20 | 15     |
| 2          | 2019-02-21 | 2019-03-31 | 30     |

UnitsSold table:

| product_id | purchase_date | units |
|------------|---------------|-------|
| 1          | 2019-02-25    | 100   |
| 1          | 2019-03-01    | 15    |
| 2          | 2019-02-10    | 200   |
| 2          | 2019-03-22    | 30    |

Output: 

| product_id | average_price |
|------------|---------------|
| 1          | 6.96          |
| 2          | 16.96         |

Explanation: 

- Average selling price = Total Price of Product / Number of products sold.
- Average selling price for product 1 = ((100 * 5) + (15 * 20)) / 115 = 6.96
- Average selling price for product 2 = ((200 * 15) + (30 * 30)) / 230 = 16.96

### 1075: Project Employees I

Write an SQL query that reports the average experience years of all the employees for each project, rounded to 2 digits.

Return the result table in any order.

Table: Project

| Column Name | Type    |
|----------|----------|
| project_id  | int     |
| employee_id | int     |

- (project_id, employee_id) is the primary key of this table.
- employee_id is a foreign key to Employee table.
- Each row of this table indicates that the employee with employee_id is working on the project with project_id.
 

Table: Employee

| Column Name | Type    |
|----------|----------|
| employee_id      | int     |
| name             | varchar |
| experience_years | int     |

- employee_id is the primary key of this table. It's guaranteed that experience_years is not NULL.
- Each row of this table contains information about one employee.

### 1633: Percentage of Users Attended a Contest
Write a solution to find the percentage of the users registered in each contest rounded to two decimals.

Return the result table ordered by percentage in descending order. In case of a tie, order it by contest_id in ascending order.

Table: Users

| Column Name | Type    |
|----------|----------|
| user_id     | int     |
| user_name   | varchar |

- user_id is the primary key (column with unique values) for this table.
- Each row of this table contains the name and the id of a user.
 

Table: Register

| Column Name | Type    |
|----------|----------|
| contest_id  | int     |
| user_id     | int     |

- (contest_id, user_id) is the primary key (combination of columns with unique values) for this table.
- Each row of this table contains the id of a user and the contest they registered into.

### 1211: Queries Quality and Percentage

We define query quality as:

The average of the ratio between query rating and its position.

We also define poor query percentage as:

The percentage of all queries with rating less than 3.

Write a solution to find each query_name, the quality and poor_query_percentage.

Both quality and poor_query_percentage should be rounded to 2 decimal places.

Return the result table in any order.

Table: Queries

| Column Name | Type    |
|----------|----------|
| query_name  | varchar |
| result      | varchar |
| position    | int     |
| rating      | int     |

- This table may have duplicate rows.
- This table contains information collected from some queries on a database.
- The position column has a value from 1 to 500.
- The rating column has a value from 1 to 5. Query with rating less than 3 is a poor query.
 
Example:

Input: 
Queries table:

| query_name | result            | position | rating |
|------------|-------------------|----------|--------|
| Dog        | Golden Retriever  | 1        | 5      |
| Dog        | German Shepherd   | 2        | 5      |
| Dog        | Mule              | 200      | 1      |
| Cat        | Shirazi           | 5        | 2      |
| Cat        | Siamese           | 3        | 3      |
| Cat        | Sphynx            | 7        | 4      |

Output: 

| query_name | quality | poor_query_percentage |
|------------|---------|-----------------------|
| Dog        | 2.50    | 33.33                 |
| Cat        | 0.66    | 33.33                 |

Explanation: 
- Dog queries quality is ((5 / 1) + (5 / 2) + (1 / 200)) / 3 = 2.50
- Dog queries poor_ query_percentage is (1 / 3) * 100 = 33.33

- Cat queries quality equals ((2 / 5) + (3 / 3) + (4 / 7)) / 3 = 0.66
- Cat queries poor_ query_percentage is (1 / 3) * 100 = 33.33

In [ ]:
select query_name, cast(round(avg(rating*1.0/position), 2) as DECIMAL(8,2)) as quality, 
round(avg(case when rating < 3 then 1.0 else 0 end)*100,2) as poor_query_percentage  from Queries group by query_name

### 1193: Monthly Transactions I (Medium)

Write an SQL query to find for each month and country, the number of transactions and their total amount, the number of approved transactions and their total amount.

Return the result table in any order.

Table: Transactions

| Column Name | Type    |
|----------|----------|
| id            | int     |
| country       | varchar |
| state         | enum    |
| amount        | int     |
| trans_date    | date    |

- id is the primary key of this table.
- The table has information about incoming transactions.
- The state column is an enum of type ["approved", "declined"].
 
Example 1:

Input: 
Transactions table:

| id   | country | state    | amount | trans_date |
|------|---------|----------|--------|------------|
| 121  | US      | approved | 1000   | 2018-12-18 |
| 122  | US      | declined | 2000   | 2018-12-19 |
| 123  | US      | approved | 2000   | 2019-01-01 |
| 124  | DE      | approved | 2000   | 2019-01-07 |

Output: 

| month    | country | trans_count | approved_count | trans_total_amount | approved_total_amount |
|----------|---------|-------------|----------------|--------------------|-----------------------|
| 2018-12  | US      | 2           | 1              | 3000               | 1000                  |
| 2019-01  | US      | 1           | 1              | 2000               | 2000                  |
| 2019-01  | DE      | 1           | 1              | 2000               | 2000                  |

### 1174: Immediate Food Delivery II (Medium)
Write a solution to find the percentage of immediate orders in the first orders of all customers, rounded to 2 decimal places.

Table: Delivery

| Column Name | Type    |
|----------|----------|
| delivery_id                 | int     |
| customer_id                 | int     |
| order_date                  | date    |
| customer_pref_delivery_date | date    |

- delivery_id is the column of unique values of this table.
- The table holds information about food delivery to customers that make orders at some date and specify a - - preferred delivery date (on the same order date or after it).
 

If the customer's preferred delivery date is the same as the order date, then the order is called immediate; otherwise, it is called scheduled.

The first order of a customer is the order with the earliest order date that the customer made. It is guaranteed that a customer has precisely one first order.

### 550: Game Play Analysis IV (Medium)
Write a solution to report the fraction of players that logged in again on the day after the day they first logged in, rounded to 2 decimal places. In other words, you need to determine the number of players who logged in on the day immediately following their initial login, and divide it by the number of total players.

Table: Activity

| Column Name | Type    |
|----------|----------|
| player_id    | int     |
| device_id    | int     |
| event_date   | date    |
| games_played | int     |

- (player_id, event_date) is the primary key (combination of columns with unique values) of this table.
- This table shows the activity of players of some games.
- Each row is a record of a player who logged in and played a number of games (possibly 0) before logging out on someday using some device.

Activity table:

| player_id | device_id | event_date | games_played |
|-----------|-----------|------------|--------------|
| 1         | 2         | 2016-03-01 | 5            |
| 1         | 2         | 2016-03-02 | 6            |
| 2         | 3         | 2017-06-25 | 1            |
| 3         | 1         | 2016-03-02 | 0            |
| 3         | 4         | 2018-07-03 | 5            |

Output: 

| fraction  |
|-----------|
| 0.33      |

Explanation: 
Only the player with id 1 logged back in after the first day he had logged in so the answer is 1/3 = 0.33

## Sorting and Grouping

### 2356: Number of Unique Subjects Taught by Each Teacher
Write a solution to calculate the number of unique subjects each teacher teaches in the university.

Return the result table in any order.

Table: Teacher

| Column Name | Type    |
|----------|----------|
| teacher_id  | int  |
| subject_id  | int  |
| dept_id     | int  |

- (subject_id, dept_id) is the primary key (combinations of columns with unique values) of this table.
- Each row in this table indicates that the teacher with teacher_id teaches the subject subject_id in the department dept_id.


 Output:  

| teacher_id | cnt |
|------------|-----|
| 1          | 2   |
| 2          | 4   |

In [ ]:
select teacher_id, count(distinct subject_id) as cnt from Teacher group by teacher_id

### 1141: User Activity for the Past 30 Days I
Write a solution to find the daily active user count for a period of 30 days ending 2019-07-27 inclusively. A user was active on someday if they made at least one activity on that day.

Return the result table in any order.

Note: Any activity from ('open_session', 'end_session', 'scroll_down', 'send_message') will be considered valid activity for a user to be considered active on a day

Table: Activity

| Column Name | Type    |
|----------|----------|
| user_id       | int     |
| session_id    | int     |
| activity_date | date    |
| activity_type | enum    |

- This table may have duplicate rows.
- The activity_type column is an ENUM (category) of type ('open_session', 'end_session', 'scroll_down', 'send_message').
- The table shows the user activities for a social media website. 
- Note that each session belongs to exactly one user.

Input: 
Activity table:

| user_id | session_id | activity_date | activity_type |
|---------|------------|---------------|---------------|
| 1       | 1          | 2019-07-20    | open_session  |
| 1       | 1          | 2019-07-20    | scroll_down   |
| 1       | 1          | 2019-07-20    | end_session   |
| 2       | 4          | 2019-07-20    | open_session  |
| 2       | 4          | 2019-07-21    | send_message  |
| 2       | 4          | 2019-07-21    | end_session   |
| 3       | 2          | 2019-07-21    | open_session  |
| 3       | 2          | 2019-07-21    | send_message  |
| 3       | 2          | 2019-07-21    | end_session   |
| 4       | 3          | 2019-06-25    | open_session  |
| 4       | 3          | 2019-06-25    | end_session   |


Output: 
 
| day        | active_users |
|------------|--------------| 
| 2019-07-20 | 2            |
| 2019-07-21 | 2            |

### 1070: Product Sales Analysis III (Medium)
Write a solution to find all sales that occurred in the first year each product was sold.

For each product_id, identify the earliest year it appears in the Sales table.

Return all sales entries for that product in that year.

Return a table with the following columns: product_id, first_year, quantity, and price.
Return the result in any order.

Table: Sales

| Column Name | Type    |
|----------|----------|
| sale_id     | int   |
| product_id  | int   |
| year        | int   |
| quantity    | int   |
| price       | int   |

- (sale_id, year) is the primary key (combination of columns with unique values) of this table.
- Each row records a sale of a product in a given year.
- A product may have multiple sales entries in the same year.
- Note that the per-unit price.


Input: 
Sales table:

| sale_id | product_id | year | quantity | price |
|---------|------------|------|----------|-------| 
| 1       | 100        | 2008 | 10       | 5000  |
| 2       | 100        | 2009 | 12       | 5000  |
| 7       | 200        | 2011 | 15       | 9000  |


Output: 

| product_id | first_year | quantity | price |
|------------|------------|----------|-------| 
| 100        | 2008       | 10       | 5000  |
| 200        | 2011       | 15       | 9000  |

### 596: Classes With at Least 5 Students
Write a solution to find all the classes that have at least five students.

Return the result table in any order.

Table: Courses

| Column Name | Type    |
|----------|----------|
| student     | varchar |
| class       | varchar |

- (student, class) is the primary key (combination of columns with unique values) for this table.
- Each row of this table indicates the name of a student and the class in which they are enrolled.

Output: 

| class   |
|---------|
| Math    |

In [ ]:
select class from Courses group by class having count(distinct student) >= 5

### 1729: Find Followers Count
Write a solution that will, for each user, return the number of followers.

Return the result table ordered by user_id in ascending order.

Table: Followers

| Column Name | Type    |
|----------|----------|
| user_id     | int  |
| follower_id | int  |

- (user_id, follower_id) is the primary key (combination of columns with unique values) for this table.
- This table contains the IDs of a user and a follower in a social media app where the follower follows the user.


Output: 

| user_id | followers_count|
|---------|----------------|
| 0       | 1              |
| 1       | 1              |
| 2       | 2              |

In [ ]:
select user_id, count(distinct follower_id) as followers_count from Followers group by user_id order by followers_count

### 619: Biggest Single Number
A single number is a number that appeared only once in the MyNumbers table.

Find the largest single number. If there is no single number, report null.

Table: MyNumbers

| Column Name | Type    |
|----------|----------|
| num         | int  |

- This table may contain duplicates (In other words, there is no primary key for this table in SQL).
- Each row of this table contains an integer.

Input: 
MyNumbers table:

| num |
|-----|
| 8   |
| 8   |
| 3   |
| 3   |
| 1   |
| 4   |
| 5   |
| 6   |

Output: 

| num |
|-----|
| 6   |

In [ ]:
select

### 1045: Customers Who Bought All Products
Write a solution to report the customer ids from the Customer table that bought all the products in the Product table.

Return the result table in any order.

Table: Customer

| Column Name | Type    |
|----------|----------|
| customer_id | int     |
| product_key | int     |

- This table may contain duplicates rows. 
- customer_id is not NULL.
- product_key is a foreign key (reference column) to Product table.
 

Table: Product

| Column Name | Type    |
|----------|----------|
| product_key | int     |

- product_key is the primary key (column with unique values) for this table.

## Advanced Select and Joins

### 1731: The Number of Employees Which Report to Each Employee

Write a solution to report the ids and the names of all managers, the number of employees who report directly to them, and the average age of the reports rounded to the nearest integer.

Return the result table ordered by employee_id

Table: Employees

| Column Name | Type    |
|----------|----------|
| employee_id | int      |
| name        | varchar  |
| reports_to  | int      |
| age         | int      |

- employee_id is the column with unique values for this table.
- This table contains information about the employees and the id of the manager they report to. Some employees do not report to anyone (reports_to is null). 
 
- For this problem, we will consider a manager an employee who has at least 1 other employee reporting to them.

### 1789: Primary Department for Each Employee

Write a solution to report all the employees with their primary department. For employees who belong to one department, report their only department.

Return the result table in any order.

Table: Employee

| Column Name | Type    |
|----------|----------|
| employee_id   | int     |
| department_id | int     |
| primary_flag  | varchar |

- (employee_id, department_id) is the primary key (combination of columns with unique values) for this table.
- employee_id is the id of the employee.
- department_id is the id of the department to which the employee belongs.
- primary_flag is an ENUM (category) of type ('Y', 'N'). If the flag is 'Y', the department is the primary department for the employee. If the flag is 'N', the department is not the primary.
 

Employees can belong to multiple departments. When the employee joins other departments, they need to decide which department is their primary department. Note that when an employee belongs to only one department, their primary column is 'N'.

### 610: Triangle Judgement

Report for every three line segments whether they can form a triangle.

Return the result table in any order

Table: Triangle

| Column Name | Type    |
|----------|----------|
| x           | int  |
| y           | int  |
| z           | int  |

- In SQL, (x, y, z) is the primary key column for this table.
- Each row of this table contains the lengths of three line segments.

### 180: Consecutive Numbers
Find all numbers that appear at least three times consecutively.

Return the result table in any order.

Table: Logs

| Column Name | Type    |
|----------|----------|
| id          | int     |
| num         | varchar |

- In SQL, id is the primary key for this table.
- id is an autoincrement column starting from 1.

### 1164: Product Price at a Given Date
Write a solution to find the prices of all products on the date 2019-08-16.

Return the result table in any order.

Table: Products

| Column Name | Type    |
|----------|----------|
| product_id    | int     |
| new_price     | int     |
| change_date   | date    |

- (product_id, change_date) is the primary key (combination of columns with unique values) of this table.
- Each row of this table indicates that the price of some product was changed to a new price at some date.
- Initially, all products have price 10.

### 1204: Last Person to Fit in the Bus
Write a solution to find the person_name of the last person that can fit on the bus without exceeding the weight limit. The test cases are generated such that the first person does not exceed the weight limit.

Note that only one person can board the bus at any given turn.

Table: Queue

| Column Name | Type    |
|----------|----------|
| person_id   | int     |
| person_name | varchar |
| weight      | int     |
| turn        | int     |

- person_id column contains unique values.
- This table has the information about all people waiting for a bus.
- The person_id and turn columns will contain all numbers from 1 to n, where n is the number of rows in the table.
turn determines the order of which the people will board the bus, where turn=1 denotes the first person to board and turn=n denotes the last person to board.
- weight is the weight of the person in kilograms.
 
There is a queue of people waiting to board a bus. However, the bus has a weight limit of 1000 kilograms, so there may be some people who cannot board.

### 1907: Count Salary Categories
Write a solution to calculate the number of bank accounts for each salary category. The salary categories are:

- "Low Salary": All the salaries strictly less than \$20000.
- "Average Salary": All the salaries in the inclusive range [$20000, $50000].
- "High Salary": All the salaries strictly greater than $50000.

The result table must contain all three categories. If there are no accounts in a category, return 0.

Return the result table in any order.

Table: Accounts

| Column Name | Type    |
|----------|----------|
| account_id  | int  |
| income      | int  |

- account_id is the primary key (column with unique values) for this table.
- Each row contains information about the monthly income for one bank account.

## Subqueries

### 1978: Employees Whose Manager Left the Company
Find the IDs of the employees whose salary is strictly less than $30000 and whose manager left the company. When a manager leaves the company, their information is deleted from the Employees table, but the reports still have their manager_id set to the manager that left.

Return the result table ordered by employee_id.

Table: Employees

| Column Name | Type    |
|----------|----------|
| employee_id | int      |
| name        | varchar  |
| manager_id  | int      |
| salary      | int      |

- In SQL, employee_id is the primary key for this table.
- This table contains information about the employees, their salary, and the ID of their manager. Some employees do not have a manager (manager_id is null).

### 626: Exchange Seats
Write a solution to swap the seat id of every two consecutive students. If the number of students is odd, the id of the last student is not swapped.

Return the result table ordered by id in ascending order.

Table: Seat

| Column Name | Type    |
|----------|----------|
| id          | int     |
| student     | varchar |

- id is the primary key (unique value) column for this table.
- Each row of this table indicates the name and the ID of a student.
- The ID sequence always starts from 1 and increments continuously.

### 1341: Movie Rating
Write a solution to:

Find the name of the user who has rated the greatest number of movies. In case of a tie, return the lexicographically smaller user name.
Find the movie name with the highest average rating in February 2020. In case of a tie, return the lexicographically smaller movie name.

Table: Movies

| Column Name | Type    |
|----------|----------|
| movie_id      | int     |
| title         | varchar |

- movie_id is the primary key (column with unique values) for this table.
- title is the name of the movie.
- Each movie has a unique title.
  
Table: Users

| Column Name | Type    |
|----------|----------|
| user_id       | int     |
| name          | varchar |

- user_id is the primary key (column with unique values) for this table.
- The column 'name' has unique values.

Table: MovieRating

| Column Name | Type    |
|----------|----------|
| movie_id      | int     |
| user_id       | int     |
| rating        | int     |
| created_at    | date    |

- (movie_id, user_id) is the primary key (column with unique values) for this table.
- This table contains the rating of a movie by a user in their review.
- created_at is the user's review date.

### 1321: Restaurant Growth
You are the restaurant owner and you want to analyze a possible expansion (there will be at least one customer every day).

Compute the moving average of how much the customer paid in a seven days window (i.e., current day + 6 days before). average_amount should be rounded to two decimal places.

Return the result table ordered by visited_on in ascending order.

Table: Customer

| Column Name | Type    |
|----------|----------|
| customer_id   | int     |
| name          | varchar |
| visited_on    | date    |
| amount        | int     |

- In SQL,(customer_id, visited_on) is the primary key for this table.
- This table contains data about customer transactions in a restaurant.
- visited_on is the date on which the customer with ID (customer_id) has visited the restaurant.
amount is the total paid by a customer.

### 602: Friend Requests II: Who Has the Most Friends
Write a solution to find the people who have the most friends and the most friends number.

The test cases are generated so that only one person has the most friends.

Table: RequestAccepted

| Column Name | Type    |
|----------|----------|
| requester_id   | int     |
| accepter_id    | int     |
| accept_date    | date    |

- (requester_id, accepter_id) is the primary key (combination of columns with unique values) for this table.
- This table contains the ID of the user who sent the request, the ID of the user who received the request, and the date when the request was accepted.

### 585: Investments in 2016
Write a solution to report the sum of all total investment values in 2016 tiv_2016, for all policyholders who:

have the same tiv_2015 value as one or more other policyholders, and
are not located in the same city as any other policyholder (i.e., the (lat, lon) attribute pairs must be unique).
Round tiv_2016 to two decimal places.

Table: Insurance

| Column Name | Type    |
|----------|----------|
| pid         | int   |
| tiv_2015    | float |
| tiv_2016    | float |
| lat         | float |
| lon         | float |

- pid is the primary key (column with unique values) for this table.
- Each row of this table contains information about one policy where:
- pid is the policyholder's policy ID.
- tiv_2015 is the total investment value in 2015 and tiv_2016 is the total investment value in 2016.
- lat is the latitude of the policy holder's city. It's guaranteed that lat is not NULL.
- lon is the longitude of the policy holder's city. It's guaranteed that lon is not NULL.

### 185: Department Top Three Salaries
A company's executives are interested in seeing who earns the most money in each of the company's departments. A high earner in a department is an employee who has a salary in the top three unique salaries for that department.

Write a solution to find the employees who are high earners in each of the departments.

Return the result table in any order.

Table: Employee

| Column Name | Type    |
|----------|----------|
| id           | int     |
| name         | varchar |
| salary       | int     |
| departmentId | int     |

id is the primary key (column with unique values) for this table.
departmentId is a foreign key (reference column) of the ID from the Department table.
Each row of this table indicates the ID, name, and salary of an employee. It also contains the ID of their department.
 

Table: Department

| Column Name | Type    |
|----------|----------|
| id          | int     |
| name        | varchar |

- id is the primary key (column with unique values) for this table.
- Each row of this table indicates the ID of a department and its name.

## Advanced String Functions / Regex / Clause

### 1667: Fix Names in a Table
Write a solution to fix the names so that only the first character is uppercase and the rest are lowercase.

Return the result table ordered by user_id.

Table: Users

| Column Name | Type    |
|----------|----------|
| user_id        | int     |
| name           | varchar |
+----------------+---------+
- user_id is the primary key (column with unique values) for this table.
- This table contains the ID and the name of the user. The name consists of only lowercase and uppercase characters.

### 1527: Patients With a Condition
Write a solution to find the patient_id, patient_name, and conditions of the patients who have Type I Diabetes. Type I Diabetes always starts with DIAB1 prefix.

Return the result table in any order.

Table: Patients

| Column Name | Type    |
|----------|----------|
| patient_id   | int     |
| patient_name | varchar |
| conditions   | varchar |

- patient_id is the primary key (column with unique values) for this table.
- 'conditions' contains 0 or more code separated by spaces. 
- This table contains information of the patients in the hospital.

### 196: Delete Duplicate Emails
Write a solution to delete all duplicate emails, keeping only one unique email with the smallest id.

For SQL users, please note that you are supposed to write a DELETE statement and not a SELECT one.

For Pandas users, please note that you are supposed to modify Person in place.

After running your script, the answer shown is the Person table. The driver will first compile and run your piece of code and then show the Person table. 

The final order of the Person table does not matter.

Table: Person

| Column Name | Type    |
|----------|----------|
| id          | int     |
| email       | varchar |

id is the primary key (column with unique values) for this table.
Each row of this table contains an email. The emails will not contain uppercase letters.

### 176: Second Highest Salary
Write a solution to find the second highest distinct salary from the Employee table. If there is no second highest salary, return null (return None in Pandas).

Table: Employee

| Column Name | Type    |
|----------|----------|
| id          | int  |
| salary      | int  |

- id is the primary key (column with unique values) for this table.
- Each row of this table contains information about the salary of an employee.

### 1484: Group Sold Products By The Date

Write a solution to find for each date the number of different products sold and their names.

The sold products names for each date should be sorted lexicographically.

Return the result table ordered by sell_date.

Table Activities:

| Column Name | Type    |
|----------|----------|
| sell_date   | date    |
| product     | varchar |

- There is no primary key (column with unique values) for this table. It may contain duplicates.
- Each row of this table contains the product name and the date it was sold in a market.

### 1327: List the Products Ordered in a Period
Write a solution to get the names of products that have at least 100 units ordered in February 2020 and their amount.

Return the result table in any order.

Table: Products

| Column Name | Type    |
|----------|----------|
| product_id       | int     |
| product_name     | varchar |
| product_category | varchar |

- product_id is the primary key (column with unique values) for this table.
- This table contains data about the company's products.
 

Table: Orders

| Column Name | Type    |
|----------|----------|
| product_id    | int     |
| order_date    | date    |
| unit          | int     |

- This table may have duplicate rows.
- product_id is a foreign key (reference column) to the Products table.
- unit is the number of products ordered in order_date.

### 1517: Find Users With Valid E-Mails
Write a solution to find the users who have valid emails.

A valid e-mail has a prefix name and a domain where:

The prefix name is a string that may contain letters (upper or lower case), digits, underscore '_', period '.', and/or dash '-'. The prefix name must start with a letter.
The domain is '@leetcode.com'.
Return the result table in any order.

Table: Users

| Column Name | Type    |
|----------|----------|
| user_id       | int     |
| name          | varchar |
| mail          | varchar |

- user_id is the primary key (column with unique values) for this table.
- This table contains information of the users signed up in a website. Some e-mails are invalid.